1) Разместить в динамической памяти 2 массива – 2 матрицы размерностью n на n с
элементами типа double (значения n и элементы массивов ввести с консоли). 

2) А также ввести с консоли знак операции: '+', '-' или '*'. Написать функцию, вычисляющую
сумму, разность или произведение данных матриц (их передать по указателю) и
возвращающую указатель на массив-результат. 
  
3) Разместить эту функцию в отдельном модуле (отличном от того, где располагается функция main()). 
  
4) Выдать на консоль значения полученного вектора
